app/controllers/items_controller.rb

  def buy_div
    respond_to do |wants|
      wants.js do
        @item = Item.find(params[:id])
        unless @fl
          @fl = true
          @select_storages, storage_id = select_storages('storage', @item)
          puts @select_storages, '==========================='
          item_storage = ItemStorage.find(:first,
          :conditions => ['storage_id = ? AND item_id = ?',
            storage_id, @item.id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)
SELECT * FROM "item_storages" WHERE (storage_id = 1 AND item_id = 1) LIMIT 1
SELECT * FROM "storages" WHERE ("storages"."id" = 2)

  def buy
    respond_to do |wants|
      wants.js do
        item = Item.find(params[:id])
        item_storage = ItemStorage.find(:first,
        :conditions => ['storage_id = ? AND item_id = ?',
          params[:storage], item.id])
        q = params[:quantity].to_i
        if q > item_storage.quantity
          @id = item.id
          render :update do |page|
            page.replace_html("buy#{@id}", inline_menu(item).to_s + render(:partial => 'buy_button') )
            page.alert("На данном складе нет такого количества товара.")
          end
        else
          item_storage.quantity -= q
          item_storage.save
---
SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT "item_storages".id FROM "item_storages" WHERE ("item_storages"."item_id" = 1 AND "item_storages".storage_id = 2 AND "item_storages".id <> 2) LIMIT 1
SELECT * FROM "storages" WHERE ("storages"."id" = 2)
UPDATE "item_storages" SET "updated_at" = '2010-05-29 14:50:16.499638', "quantity" = -900 WHERE "id" = 2
UPDATE "items" SET "updated_at" = '2010-05-26 19:13:37.553067', "rating" = 41 WHERE "id" = 2

  def buy_storage
    respond_to do |wants|
      wants.js do
        item_storage = ItemStorage.find(:first,
        :conditions => ['storage_id = ? AND item_id = ?',
          params[:storage], params[:id]])
---
SELECT * FROM "item_storages" WHERE (storage_id = E'1' AND item_id = E'1') LIMIT 1

  def list
    unless params['catalogue_id'].blank?
      @items = Item.find(:all, :conditions => ['catalogue_id = ?', params['catalogue_id']])
      @bests = Item.find(:all, :conditions => ['catalogue_id = ?', params['catalogue_id']], :order => 'rating_cat DESC', :limit => 3)
---
SELECT * FROM "items" WHERE (catalogue_id = E'2')
SELECT * FROM "items" WHERE (catalogue_id = E'2') ORDER BY rating_cat DESC LIMIT 3

  def plus
    respond_to do |wants|
      wants.js do
        item = Item.find(params[:id])
        item[:rating] +=1
        item.save
---
SELECT * FROM "items" WHERE ("items"."id" = 3)
UPDATE "items" SET "updated_at" = '2010-05-26 18:48:42.436791', "rating" = 11 WHERE "id" = 3

  def minus
    respond_to do |wants|
      wants.js do
        item = Item.find(params[:id])
        item[:rating] -=1
        item.save
---
SELECT * FROM "items" WHERE ("items"."id" = 3)
UPDATE "items" SET "updated_at" = '2010-05-26 18:49:52.003089', "rating" = 11 WHERE "id" = 3

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 16)

  def edit_commit
    id = nil
    rollback = false
    ItemPeriod.transaction do
      ItemStorage.transaction do
        Item.transaction do
          i = Item.find(params[:item][:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 16)

    def show
      @item = Item.find(params[:id])
      if @item.rating == Item.minimum('rating')
---
SELECT * FROM "items" WHERE ("items"."id" = 3)
SELECT min("items".rating_cat) AS min_rating_cat FROM "items"