app/controllers/items_controller.rb

    def show
      @item = Item.find(params[:id])
      if @item.buy_count == Item.minimum('buy_count')
        @price = 0.95 * @item.price
        @discount = 5
      elsif @item.buy_count == @item.catalogue.min
---
SELECT * FROM "catalogues" WHERE ("catalogues"."id" = 2)